Tekla.Structures.Drawing.EmbeddedObjectScalingOptions
The options for controlling the scaling of the objects in the drawing.

Tekla.Structures.Drawing.EmbeddedObjectScalingOptions.ScaleX
Scales the object in the X direction.

Tekla.Structures.Drawing.EmbeddedObjectScalingOptions.ScaleXY
Scales the object in the X and Y directions.

Tekla.Structures.Drawing.EmbeddedObjectScalingOptions.ScaleToFit
Scales the object to fit in the frame in the Y direction.

Tekla.Structures.Drawing.EmbeddedObjectScalingOptions.ScaleBestFit
The object is scaled inside the frame,
still maintaining its original aspect ratio.